src/cf/DataProcessors/уатПакетнаяВыпискаЗаказовГрузоотправителей_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатПакетнаяВыпискаЗаказовГрузоотправителей_уэ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/AccumulationRegisters/уатПланРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатПланРаботыТС</Name>
			<Comment>План работы ТС</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте сценария с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВал</Name>
					<Comment>Сумма НДС в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРазделыПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>Параметр выработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДетализацияПланирования</Name>
					<Comment>Детализация планирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:EnumRef.уатПринадлежностьТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Маршрут</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура груза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыГНГ</v8:Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Статья</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыДоставки_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыДоставки_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДверьДверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДверьСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладДверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладСклад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатЕдиницыИзмеренияВеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатЕдиницыИзмеренияВеса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Килограмм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тонна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатЕдиницыИзмеренияОбъема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатЕдиницыИзмеренияОбъема</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МетрКубический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Литр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВариантыАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыАналитик</Name>
			<Comment>Варианты аналитик</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринадлежностьТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузоотправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузополучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодЕТСНГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодГНГ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатДетализацияЗаказаГрузоотправителя_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатДетализацияЗаказаГрузоотправителя_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрузовымМестам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТоварам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеРегламентированногоУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатСтатьиДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСтатьиДоходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.уатРегламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияМеждуТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияМеждуАналитиками</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуАналитиками</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределениеНепрямыхДоходовПоЗаказам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРаспределениеНепрямыхДоходовРасходовПоЗаказам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеДоходовПоСцепкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияВнутриСцепки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРаспределенияВнутриСцепки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуЗаказами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/уатПакетнаяВыпискаЗаказовГрузоотправителей_уэ/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// начало блока стандартных операций
	//ДопПараметрыОткрытие = Новый Структура("ИмяФормы", ИмяФормы);
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	Если НЕ ЗначениеЗаполнено(ДатаФормирования) Тогда
		ДатаФормирования = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		Элементы.ГруппаВидОперации.Видимость = Ложь;
		ВидОперации = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// начало блока стандартных операций
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	Если ВладелецФормы <> Неопределено И ВладелецФормы.ИмяФормы = "Обработка.уатАРМЛогиста_уэ.Форма.Форма" Тогда
		ДатаФормирования = ВладелецФормы.ДатаПланирования;	
	КонецЕсли;
	
	ВидОперацииПриИзменении();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаФормированияПриИзменении(Элемент)
	Заполнить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Заполнить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Заполнить(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Потребности

&НаКлиенте
Процедура ПотребностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	Если (Поле.Имя = "ЗаказыДокументПотребностьНомер"
		ИЛИ Поле.Имя = "ЗаказыДокументПотребностьДата"
		ИЛИ Поле.Имя = "ЗаказыДокументПотребностьНомерСтроки")
		И ЗначениеЗаполнено(ТекСтрока.ДокументПотребность) Тогда
		ПоказатьЗначение(Неопределено,ТекСтрока.ДокументПотребность);
	ИначеЕсли (Поле.Имя = "ПотребностиДокументЗаказНомер"
		ИЛИ Поле.Имя = "ПотребностиДокументЗаказДата")
		И ЗначениеЗаполнено(ТекСтрока.ДокументЗаказ) Тогда
		ПоказатьЗначение(Неопределено,ТекСтрока.ДокументЗаказ);
	ИначеЕсли Поле.Имя = "ПотребностиКонтрагент"
		И ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
		ПоказатьЗначение(Неопределено,ТекСтрока.Контрагент);
	ИначеЕсли Поле.Имя = "ПотребностиДоговорКонтрагента"
		И ЗначениеЗаполнено(ТекСтрока.ДоговорКонтрагента) Тогда
		ПоказатьЗначение(Неопределено,ТекСтрока.ДоговорКонтрагента);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыТребованиеКТСПриИзменении(Элемент)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ТребованиеКТС) Тогда
		ТекСтрока.ТребованиеКТСТипТС = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.ТребованиеКТС, "ТипТС");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотребностиТребованиеКТСТипТСПриИзменении(Элемент)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ТребованиеКТСТипТС) Тогда
		Модель_ТипТС = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.ТребованиеКТС, "ТипТС");
		Если Модель_ТипТС <> ТекСтрока.ТребованиеКТСТипТС Тогда
			ТекСтрока.ТребованиеКТС = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотребностиКонтрагентПриИзменении(Элемент)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	СтруктураСтроки = Новый Структура("Контрагент, КонтактноеЛицоЗаказчика", ТекСтрока.Контрагент, ТекСтрока.КонтактноеЛицоЗаказчика);
	КонтрагентПриИзмененииСервер(СтруктураСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузоотправительПриИзменении(Элемент)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	СтруктураСтроки = Новый Структура("Грузоотправитель, КонтактноеЛицоГрузоотправителя, ВидДоставки, АдресОтправления",
		ТекСтрока.Грузоотправитель, ТекСтрока.КонтактноеЛицоГрузоотправителя, ТекСтрока.ВидДоставки, ТекСтрока.АдресОтправления);
		
	АдресИзменен = Ложь;
	ГрузоотправительПриИзмененииСервер(СтруктураСтроки, АдресИзменен);
	Если АдресИзменен Тогда 
		ТекСтрока.АдресОтправления = СтруктураСтроки.АдресОтправления;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузоотправительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	Если ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладДверь")
		ИЛИ ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладСклад") Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузоотправительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	Если ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладДверь")
		ИЛИ ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладСклад") Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузоотправительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	Если ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладДверь")
		ИЛИ ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладСклад") Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПотребностиКонтактноеЛицоЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	уатОбщегоНазначенияТиповыеКлиент.уатНачалоВыбораКонтактногоЛицаКонтрагента(Элемент, СтандартнаяОбработка,
		ТекСтрока.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКонтактноеЛицоГрузоотправителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	уатОбщегоНазначенияТиповыеКлиент.уатНачалоВыбораКонтактногоЛицаКонтрагента(Элемент, СтандартнаяОбработка,
		?(Не ЗначениеЗаполнено(ТекСтрока.Грузоотправитель), ТекСтрока.Контрагент, ТекСтрока.Грузоотправитель));
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузополучательПриИзменении(Элемент)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	СтруктураСтроки = Новый Структура("Грузополучатель, КонтактноеЛицоГрузополучателя, ВидДоставки, АдресНазначения",
		ТекСтрока.Грузополучатель, ТекСтрока.КонтактноеЛицоГрузополучателя, ТекСтрока.ВидДоставки, ТекСтрока.АдресНазначения);
	
	АдресИзменен = Ложь;
	ГрузополучательПриИзмененииСервер(СтруктураСтроки, АдресИзменен);
	Если АдресИзменен Тогда 
		ТекСтрока.АдресНазначения = СтруктураСтроки.АдресНазначения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузополучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	Если ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.ДверьСклад")
		ИЛИ ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладСклад") Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузополучательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	Если ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.ДверьСклад")
		ИЛИ ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладСклад") Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыГрузополучательОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	Если ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.ДверьСклад")
		ИЛИ ТекСтрока.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладСклад") Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКонтактноеЛицоГрузополучателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элементы.Потребности.ТекущиеДанные;
	
	уатОбщегоНазначенияТиповыеКлиент.уатНачалоВыбораКонтактногоЛицаКонтрагента(Элемент, СтандартнаяОбработка,
		?(Не ЗначениеЗаполнено(ТекСтрока.Грузополучатель), ТекСтрока.Контрагент, ТекСтрока.Грузополучатель));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если НЕ ЗначениеЗаполнено(ДатаФормирования)
		ИЛИ НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстНСТР = НСтр("en='Not specified all fields to update the data!';ru='Указаны не все поля для обновления данных!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;
		
	Если Потребности.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Table will be cleared before filling! Continue?';ru='Перед заполнением таблица будет очищена! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаЗаполнить", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = 0 Тогда
		ЗаполнитьТаблицуСервер();
	Иначе
		ЗаполнитьТаблицуПланСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаказы(Команда)
	
	Количество = 0;
	Для Каждого ТекСтрока Из Потребности Цикл
		Если ТекСтрока.Пометка И НЕ ЗначениеЗаполнено(ТекСтрока.ДокументЗаказ) Тогда
			Количество = Количество + 1;	
		КонецЕсли;
	КонецЦикла;
	
	Если Количество = 0 Тогда
		ТекстНСТР = НСтр("en='No lines have been selected to form orders or orders have already been formed!';ru='Не выбраны строки для формирования заказов или заказы уже сформированы!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);	
	Иначе
		ТекстНСТР = НСтр("en='Orders will be created: %1. Continue?';ru='Будет сформировано заказов: %1. Продолжить?'");
		ТекстНСТР = СтрШаблон(ТекстНСТР, Количество);
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаСформировать", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого ТекСтрока Из Потребности Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ДокументЗаказ) Тогда 
			Продолжить;
		КонецЕсли;
		ТекСтрока.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого ТекСтрока Из Потребности Цикл
		ТекСтрока.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуСервер()
	Потребности.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПотребностьВПеревозке_уэПунктыНазначения.НомерСтроки КАК ДокументПотребностьНомерСтроки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ID КАК IDСтроки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка КАК ДокументПотребность,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Грузоотправитель КАК Грузоотправитель,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Грузополучатель КАК Грузополучатель,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.АдресОтправления КАК АдресОтправления,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.АдресНазначения КАК АдресНазначения,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.КонтактноеЛицоГрузоотправителя КАК КонтактноеЛицоГрузоотправителя,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.КонтактноеЛицоГрузополучателя КАК КонтактноеЛицоГрузополучателя,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОтправлениеС КАК ОтправлениеС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОтправлениеПо КАК ОтправлениеПо,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ПрибытиеС КАК ПрибытиеС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ПрибытиеПо КАК ПрибытиеПо,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ТребованиеКТС КАК ТребованиеКТС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ТребованиеКТСТипТС КАК ТребованиеКТСТипТС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОписаниеГруза КАК ОписаниеГруза,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.Контрагент КАК Контрагент,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.КонтактноеЛицоЗаказчика КАК КонтактноеЛицоЗаказчика,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатЗаказГрузоотправителя.Ссылка КАК ДокументЗаказ,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ДетализацияЗаказов КАК ДетализацияЗакрытия,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ДатаОтправления КАК ДатаОтправления,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ДатаПрибытия КАК ДатаПрибытия,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ВидПеревозки КАК ВидПеревозки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ВидДоставки КАК ВидДоставки
	|ПОМЕСТИТЬ ВТ_БезПериодичности
	|ИЗ
	|	Документ.уатПотребностьВПеревозке_уэ.ПунктыНазначения КАК уатПотребностьВПеревозке_уэПунктыНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|		ПО уатПотребностьВПеревозке_уэПунктыНазначения.ID = уатЗаказГрузоотправителя.IDСтрокиПотребности
	|			И (НАЧАЛОПЕРИОДА(уатЗаказГрузоотправителя.ОтправлениеС, ДЕНЬ) = &ДатаЗаказа)
	|			И (НЕ уатЗаказГрузоотправителя.ПометкаУдаления)
	|ГДЕ
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.Организация = &Организация
	|	И НЕ уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ПометкаУдаления
	|	И НЕ уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ПериодическаяПотребность
	|	И НАЧАЛОПЕРИОДА(уатПотребностьВПеревозке_уэПунктыНазначения.ДатаОтправления, ДЕНЬ) = &ДатаЗаказа
	|	И ВЫБОР
	|			КОГДА &Подразделение <> &ПодразделениеПустаяСсылка
	|				ТОГДА уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.Подразделение = &Подразделение
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ПредварительнаяПотребность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПотребностьВПеревозке_уэПунктыНазначения.НомерСтроки КАК ДокументПотребностьНомерСтроки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ID КАК IDСтроки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка КАК ДокументПотребность,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Грузоотправитель КАК Грузоотправитель,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Грузополучатель КАК Грузополучатель,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.АдресОтправления КАК АдресОтправления,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.АдресНазначения КАК АдресНазначения,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.КонтактноеЛицоГрузоотправителя КАК КонтактноеЛицоГрузоотправителя,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.КонтактноеЛицоГрузополучателя КАК КонтактноеЛицоГрузополучателя,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОтправлениеС КАК ОтправлениеС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОтправлениеПо КАК ОтправлениеПо,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ПрибытиеС КАК ПрибытиеС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ПрибытиеПо КАК ПрибытиеПо,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ТребованиеКТС КАК ТребованиеКТС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ТребованиеКТСТипТС КАК ТребованиеКТСТипТС,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ОписаниеГруза КАК ОписаниеГруза,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.Контрагент КАК Контрагент,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.КонтактноеЛицоЗаказчика КАК КонтактноеЛицоЗаказчика,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатЗаказГрузоотправителя.Ссылка КАК ДокументЗаказ,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ДетализацияЗаказов КАК ДетализацияЗакрытия,
	|	уатПотребностьВПеревозке_уэДатыДействия.ДатаОтправления КАК ДатаОтправления,
	|	уатПотребностьВПеревозке_уэДатыДействия.ДатаПрибытия КАК ДатаПрибытия,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ВидПеревозки КАК ВидПеревозки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	уатПотребностьВПеревозке_уэПунктыНазначения.ВидДоставки КАК ВидДоставки,
	|	уатПотребностьВПеревозке_уэДатыДействия.IDДатыДействия КАК IDДатыДействия
	|ПОМЕСТИТЬ ВТ_ПериодическаяПотребность
	|ИЗ
	|	Документ.уатПотребностьВПеревозке_уэ.ДатыДействия КАК уатПотребностьВПеревозке_уэДатыДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПотребностьВПеревозке_уэ.ПунктыНазначения КАК уатПотребностьВПеревозке_уэПунктыНазначения
	|		ПО уатПотребностьВПеревозке_уэДатыДействия.ID = уатПотребностьВПеревозке_уэПунктыНазначения.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|		ПО уатПотребностьВПеревозке_уэДатыДействия.ID = уатЗаказГрузоотправителя.IDСтрокиПотребности
	|			И (НАЧАЛОПЕРИОДА(уатЗаказГрузоотправителя.ОтправлениеС, ДЕНЬ) = &ДатаЗаказа)
	|			И (НЕ уатЗаказГрузоотправителя.ПометкаУдаления)
	|ГДЕ
	|	уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.Организация = &Организация
	|	И НЕ уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ПометкаУдаления
	|	И уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.ПериодическаяПотребность
	|	И НАЧАЛОПЕРИОДА(уатПотребностьВПеревозке_уэДатыДействия.ДатаОтправления, ДЕНЬ) = &ДатаЗаказа
	|	И ВЫБОР
	|			КОГДА &Подразделение <> &ПодразделениеПустаяСсылка
	|				ТОГДА уатПотребностьВПеревозке_уэПунктыНазначения.Ссылка.Подразделение = &Подразделение
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ уатПотребностьВПеревозке_уэДатыДействия.Ссылка.ПредварительнаяПотребность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_БезПериодичности.ДокументПотребностьНомерСтроки КАК ДокументПотребностьНомерСтроки,
	|	ВТ_БезПериодичности.IDСтроки КАК IDСтроки,
	|	"""" КАК IDДатыДействия,
	|	ВТ_БезПериодичности.ДокументПотребность КАК ДокументПотребность,
	|	ВТ_БезПериодичности.Грузоотправитель КАК Грузоотправитель,
	|	ВТ_БезПериодичности.Грузополучатель КАК Грузополучатель,
	|	ВТ_БезПериодичности.АдресОтправления КАК АдресОтправления,
	|	ВТ_БезПериодичности.АдресНазначения КАК АдресНазначения,
	|	ВТ_БезПериодичности.КонтактноеЛицоГрузоотправителя КАК КонтактноеЛицоГрузоотправителя,
	|	ВТ_БезПериодичности.КонтактноеЛицоГрузополучателя КАК КонтактноеЛицоГрузополучателя,
	|	ВТ_БезПериодичности.ОтправлениеС КАК ОтправлениеС,
	|	ВТ_БезПериодичности.ОтправлениеПо КАК ОтправлениеПо,
	|	ВТ_БезПериодичности.ПрибытиеС КАК ПрибытиеС,
	|	ВТ_БезПериодичности.ПрибытиеПо КАК ПрибытиеПо,
	|	ВТ_БезПериодичности.ОбъектСтроительства КАК ОбъектСтроительства,
	|	ВТ_БезПериодичности.ТребованиеКТС КАК ТребованиеКТС,
	|	ВТ_БезПериодичности.ОписаниеГруза КАК ОписаниеГруза,
	|	ВТ_БезПериодичности.Контрагент КАК Контрагент,
	|	ВТ_БезПериодичности.КонтактноеЛицоЗаказчика КАК КонтактноеЛицоЗаказчика,
	|	ВТ_БезПериодичности.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_БезПериодичности.ДокументЗаказ КАК ДокументЗаказ,
	|	ВТ_БезПериодичности.ДетализацияЗакрытия КАК ДетализацияЗакрытия,
	|	ВТ_БезПериодичности.ДатаОтправления КАК ДатаОтправления,
	|	ВТ_БезПериодичности.ДатаПрибытия КАК ДатаПрибытия,
	|	ВТ_БезПериодичности.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_БезПериодичности.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	ВТ_БезПериодичности.ВидДоставки КАК ВидДоставки,
	|	ВТ_БезПериодичности.ТребованиеКТСТипТС КАК ТребованиеКТСТипТС
	|ИЗ
	|	ВТ_БезПериодичности КАК ВТ_БезПериодичности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПериодическаяПотребность.ДокументПотребностьНомерСтроки,
	|	ВТ_ПериодическаяПотребность.IDСтроки,
	|	ВТ_ПериодическаяПотребность.IDДатыДействия,
	|	ВТ_ПериодическаяПотребность.ДокументПотребность,
	|	ВТ_ПериодическаяПотребность.Грузоотправитель,
	|	ВТ_ПериодическаяПотребность.Грузополучатель,
	|	ВТ_ПериодическаяПотребность.АдресОтправления,
	|	ВТ_ПериодическаяПотребность.АдресНазначения,
	|	ВТ_ПериодическаяПотребность.КонтактноеЛицоГрузоотправителя,
	|	ВТ_ПериодическаяПотребность.КонтактноеЛицоГрузополучателя,
	|	ВТ_ПериодическаяПотребность.ОтправлениеС,
	|	ВТ_ПериодическаяПотребность.ОтправлениеПо,
	|	ВТ_ПериодическаяПотребность.ПрибытиеС,
	|	ВТ_ПериодическаяПотребность.ПрибытиеПо,
	|	ВТ_ПериодическаяПотребность.ОбъектСтроительства,
	|	ВТ_ПериодическаяПотребность.ТребованиеКТС,
	|	ВТ_ПериодическаяПотребность.ОписаниеГруза,
	|	ВТ_ПериодическаяПотребность.Контрагент,
	|	ВТ_ПериодическаяПотребность.КонтактноеЛицоЗаказчика,
	|	ВТ_ПериодическаяПотребность.ДоговорКонтрагента,
	|	ВТ_ПериодическаяПотребность.ДокументЗаказ,
	|	ВТ_ПериодическаяПотребность.ДетализацияЗакрытия,
	|	ВТ_ПериодическаяПотребность.ДатаОтправления,
	|	ВТ_ПериодическаяПотребность.ДатаПрибытия,
	|	ВТ_ПериодическаяПотребность.ВидПеревозки,
	|	ВТ_ПериодическаяПотребность.НаправлениеПеревозки,
	|	ВТ_ПериодическаяПотребность.ВидДоставки,
	|	ВТ_ПериодическаяПотребность.ТребованиеКТСТипТС
	|ИЗ
	|	ВТ_ПериодическаяПотребность КАК ВТ_ПериодическаяПотребность");
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПодразделениеПустаяСсылка", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаЗаказа", НачалоДня(ДатаФормирования));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сч = 1;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Потребности.Добавить();
		НоваяСтрока.НомерСтроки = Сч;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Сч = Сч + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПланСервер()
	
	Потребности.Очистить();
	
	ХарактеристикиСценария = уатОбщегоНазначения_проф.ЗаполнитьХарактеристикиСценария(Сценарий);
	
	ЕдиницаИзмеренияВеса    = Константы.уатЕдиницаИзмеренияВеса.Получить();
	ЕдиницаИзмеренияВесаКг  = ЕдиницаИзмеренияВеса = Перечисления.уатЕдиницыИзмеренияВеса.Килограмм;
	
	ЕдиницаИзмеренияОбъема  = Константы.уатЕдиницаИзмеренияОбъема.Получить();
	ЕдиницаИзмеренияОбъемаЛ = ЕдиницаИзмеренияОбъема = Перечисления.уатЕдиницыИзмеренияОбъема.Литр;
	
	ИспользоватьКраткосрочноеПланирование   = ХарактеристикиСценария.ИспользоватьКраткосрочноеПланирование;
	ПериодичностьКраткосрочногоПланирования = ХарактеристикиСценария.ПериодичностьКраткосрочногоПланирования;
	Периодичность                           = ХарактеристикиСценария.Периодичность;
	АвтоматическийРежимРаспределения        = ХарактеристикиСценария.РежимЗаполненияВесаОбъемаГруза = 1;
	ПериодичностьФормирования = ?(ИспользоватьКраткосрочноеПланирование, ПериодичностьКраткосрочногоПланирования, Периодичность);

	НачДата = ДатаФормирования;
	КонДата = ДатаФормирования;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, ПериодичностьФормирования);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Сценарий",      Сценарий);
	Запрос.УстановитьПараметр("Организация",   Организация); 
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПодразделениеПустаяСсылка", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("НачДата",       НачДата);
	Запрос.УстановитьПараметр("КонДата",       КонДата);
	Запрос.УстановитьПараметр("ИспользоватьКраткосрочноеПланирование", ИспользоватьКраткосрочноеПланирование);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатПланРаботыТСОбороты.Регистратор КАК Ссылка,
	               |	уатПланРаботыТСОбороты.Колонна КАК Колонна,
	               |	уатПланРаботыТСОбороты.ДетализацияПланирования КАК ТС,
	               |	уатПланРаботыТСОбороты.ВидПеревозки КАК ВидПеревозки,
	               |	уатПланРаботыТСОбороты.Контрагент КАК ВариантАналитикиКонтрагент,
	               |	уатПланРаботыТСОбороты.Договор КАК ВариантАналитикиДоговор,
	               |	уатПланРаботыТСОбороты.Маршрут КАК ВариантАналитикиМаршрут,
	               |	уатПланРаботыТСОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	уатПланРаботыТСОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
	               |	ВЫБОР
	               |		КОГДА уатПланРаботыТСОбороты.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ТОГДА уатПланРаботыТСОбороты.Сценарий.Номенклатура
	               |		ИНАЧЕ уатПланРаботыТСОбороты.Номенклатура
	               |	КОНЕЦ КАК Номенклатура,
	               |	уатПланРаботыТСОбороты.ПараметрВыработки КАК ПараметрВыработки,
	               |	уатПланРаботыТСОбороты.КоличествоОборот КАК Количество,
	               |	уатПланРаботыТСОбороты.Период КАК Дата
	               |ИЗ
	               |	РегистрНакопления.уатПланРаботыТС.Обороты(
	               |			&НачДата,
	               |			&КонДата,
	               |			Регистратор,
	               |			Сценарий = &Сценарий
	               |				И Организация = &Организация
	               |				И ВЫБОР
	               |					КОГДА Сценарий.ИспользоватьКраткосрочноеПланирование
	               |						ТОГДА Периодичность = Сценарий.ПериодичностьКраткосрочногоПланирования
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &Подразделение <> &ПодразделениеПустаяСсылка
	               |						ТОГДА Подразделение = &Подразделение
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК уатПланРаботыТСОбороты";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПланЗаказ = Потребности.Выгрузить();
	ПланЗаказ.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НачДата = Выборка.Дата;
		КонДата = Выборка.Дата;
		ПериодичностьФормирования = ?(ИспользоватьКраткосрочноеПланирование, ПериодичностьКраткосрочногоПланирования, Периодичность);
		
		уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, ПериодичностьФормирования);
		Если КонецДня(ДатаФормирования) > КонДата
			ИЛИ НачалоДня(ДатаФормирования) < НачДата Тогда
			Продолжить;
		КонецЕсли;
		
		ХарактеристикиСтроки = Новый Структура("ТС, ОбъектСтроительства, НаправлениеПеревозки, 
		|ВариантАналитикиМаршрут, ВариантАналитикиКонтрагент, ВариантАналитикиДоговор, ВидПеревозки, Колонна");
		ЗаполнитьЗначенияСвойств(ХарактеристикиСтроки, Выборка);
		
		НужнаяСтрока = Потребности.НайтиСтроки(ХарактеристикиСтроки);
		Если НужнаяСтрока.Количество() <> 0 Тогда
			НоваяСтрока = НужнаяСтрока[0];
		Иначе
			НоваяСтрока = Потребности.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Элементы.ПотребностиТС.Заголовок = ХарактеристикиСценария.ВариантАналитикиТС;
			Если ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.МодельТС Тогда
				НоваяСтрока.ТребованиеКТС = Выборка.ТС;
			ИначеЕсли ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.ТипТС Тогда
				НоваяСтрока.ТребованиеКТСТипТС  = Выборка.ТС;
			КонецЕсли;
			
			ДокументПланированияПериод = Новый СтандартныйПериод();
			ДокументПланированияПериод.ДатаНачала    = НачДата;
			ДокументПланированияПериод.ДатаОкончания = КонДата;
			
			НоваяСтрока.ДокументПланированияПериод = ДокументПланированияПериод;
			НоваяСтрока.ДокументПланирования       = Выборка.Ссылка;
			
			НоваяСтрока.ДатаОтправления            = ДатаФормирования;
			НоваяСтрока.ДатаПрибытия               = КонецДня(ДатаФормирования);
			
			Если ТипЗнч(Выборка.ВариантАналитикиМаршрут) = Тип("СправочникСсылка.уатМаршруты") Тогда
				Этапы = Выборка.ВариантАналитикиМаршрут.Этапы;
				Для Сч = 0 По Этапы.Количество()-1 Цикл 			
					Если Сч = 0 Тогда 
						НоваяСтрока.АдресОтправления = Этапы[Сч].ПунктОтправления;
					КонецЕсли;
					Если Сч = Этапы.Количество()-1 Тогда 
						Если  Выборка.ВариантАналитикиМаршрут.ПредставлениеМаршрутаОднимПунктом Тогда 
							НоваяСтрока.АдресНазначения = Этапы[Сч].ПунктОтправления;
						Иначе 
							НоваяСтрока.АдресНазначения = Этапы[Сч].ПунктПрибытия;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ХарактеристикиСценария.ВариантАналитикиМаршрут = Перечисления.уатВариантыАналитик.ПунктНазначения Тогда
				НоваяСтрока.АдресНазначения = Выборка.ВариантАналитикиМаршрут;
			Иначе
				НоваяСтрока.АдресОтправления = Выборка.ВариантАналитикиМаршрут;
			КонецЕсли;
			
			НоваяСтрока.ДоговорКонтрагента = Выборка.ВариантАналитикиДоговор; 

			Если ХарактеристикиСценария.ВариантАналитикиКонтрагент = Перечисления.уатВариантыАналитик.Заказчик Тогда
				НоваяСтрока.Контрагент = Выборка.ВариантАналитикиКонтрагент;
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДоговорКонтрагента) Тогда
					
					ДанныеОбменаССервером = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Дата, Приоритет");
					ЗаполнитьЗначенияСвойств(ДанныеОбменаССервером, НоваяСтрока);
					// Получим данные с сервера
					ДанныеОбменаССервером.Организация = Организация;
					ДанныеОбменаССервером.Дата        = ДатаФормирования;
					ДанныеОбменаССервером.Приоритет   = 0;
					ЗначенияДляЗаполнения             = ИзменениеКонтрагентаСервер(ДанныеОбменаССервером);
					НоваяСтрока.ДоговорКонтрагента    = ЗначенияДляЗаполнения.ДоговорКонтрагента;
				КонецЕсли;
			ИначеЕсли  ХарактеристикиСценария.ВариантАналитикиКонтрагент = Перечисления.уатВариантыАналитик.Грузоотправитель Тогда
				НоваяСтрока.Грузоотправитель = Выборка.ВариантАналитикиКонтрагент;
			Иначе
				НоваяСтрока.Грузополучатель = Выборка.ВариантАналитикиКонтрагент;
			КонецЕсли;
			
			ВремяДоступности = уатОбщегоНазначения_проф.ПолучитьВремяДоступностиПункта(НоваяСтрока.АдресНазначения,
				?(ЗначениеЗаполнено(НоваяСтрока.Грузополучатель), НоваяСтрока.Грузополучатель, Неопределено));
			
			НоваяСтрока.ПрибытиеС  = ВремяДоступности.ВремяДоступностиС;
			НоваяСтрока.ПрибытиеПо = ВремяДоступности.ВремяДоступностиПо;
			
			ВремяДоступности = уатОбщегоНазначения_проф.ПолучитьВремяДоступностиПункта(НоваяСтрока.АдресОтправления,
				?(ЗначениеЗаполнено(НоваяСтрока.Грузоотправитель), НоваяСтрока.Грузоотправитель, Неопределено));
			
			НоваяСтрока.ОтправлениеС  = ВремяДоступности.ВремяДоступностиС;
			НоваяСтрока.ОтправлениеПо = ВремяДоступности.ВремяДоступностиПо;
			
			НоваяСтрока.КоличествоГруза = 1;
		КонецЕсли;
		
		НоваяСтрока.ВесГрузаЕдиницаИзмерения     = ЕдиницаИзмеренияВеса;
		НоваяСтрока.ОбъемГрузаЕдиницаИзмерения   = ЕдиницаИзмеренияОбъема;

		Если Выборка.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВесГруза Тогда
			
			Если АвтоматическийРежимРаспределения Тогда
				
				КоличествоДней = (НачалоДня(КонДата) - НачалоДня(НачДата)) / 60 / 60 / 24;
				НоваяСтрока.ВесГруза       = Выборка.Количество / (КоличествоДней + 1);
				
			Иначе
				НоваяСтрока.ВесГруза       = Выборка.Количество;
			КонецЕсли;
			
			ПересчитатьВесГруза(НоваяСтрока.ВесГруза, Выборка.ПараметрВыработки.ЕдиницаИзмерения, ЕдиницаИзмеренияВеса);
			
			НоваяСтрока.ВесГрузаПланЕдиницаИзмерения = Выборка.ПараметрВыработки.ЕдиницаИзмерения;
			НоваяСтрока.ВесГрузаПлан                 = Выборка.Количество;
		ИначеЕсли Выборка.ПараметрВыработки = Справочники.уатПараметрыВыработки.Объем Тогда
			
			Если АвтоматическийРежимРаспределения Тогда
				
				КоличествоДней = (НачалоДня(КонДата) - НачалоДня(НачДата)) / 60 / 60 / 24;
				НоваяСтрока.ОбъемГруза       = Выборка.Количество / (КоличествоДней + 1);
				
			Иначе
				НоваяСтрока.ОбъемГруза       =  Выборка.Количество;
			КонецЕсли;
			
			ПересчитатьОбъемГруза(НоваяСтрока.ОбъемГруза, Выборка.ПараметрВыработки.ЕдиницаИзмерения, ЕдиницаИзмеренияОбъема);
			
			НоваяСтрока.ОбъемГрузаПланЕдиницаИзмерения = Выборка.ПараметрВыработки.ЕдиницаИзмерения;
			НоваяСтрока.ОбъемГрузаПлан                 = Выборка.Количество;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменениеКонтрагентаСервер(ДанныеДляЗаполнения)
	
	СтруктураПараметровДляПолученияДоговора =
		уатЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();
	
	ЗначенияДляЗаполнения = уатОбщегоНазначенияСервер.ПриИзмененииЗначенияКонтрагента(
		ДанныеДляЗаполнения,
		СтруктураПараметровДляПолученияДоговора
	);
	
	Если ДанныеДляЗаполнения.Свойство("Контрагент") И ДанныеДляЗаполнения.Свойство("Приоритет") Тогда 
		Если ТипЗнч(ДанныеДляЗаполнения.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда 
			ЗначенияДляЗаполнения.Вставить("Приоритет", ДанныеДляЗаполнения.Контрагент.Приоритет);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначенияДляЗаполнения;
	
КонецФункции

&НаСервере
Процедура СформироватьЗаказыСервер(Знач СтруктураДляСозданияЗаказа = Неопределено, ТекстСообщения = "")
	
	Если СтруктураДляСозданияЗаказа = Неопределено Тогда
		
		Для Каждого ТекСтрока Из Потребности Цикл
			Если Не ТекСтрока.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекСтрока.ДокументЗаказ) Тогда
				ТекстОшибки = НСтр("en='For Need for the carriage in line №';ru='Для потребности в строке №'") + Строка(ТекСтрока.НомерСтроки) + " " + НСтр("en='order already created.';ru='уже создан заказ.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			ЗаказОбъект = Документы.уатЗаказГрузоотправителя.СоздатьДокумент();
			ЗаказОбъект.Дата = ТекущаяДатаСеанса();
			ЗаказОбъект.ДетализацияЗакрытия = ТекСтрока.ДетализацияЗакрытия;
			ЗаказОбъект.Организация   = Организация;
			ЗаказОбъект.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
			ЗаказОбъект.Ответственный = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
			"ОсновнойОтветственный");
			
			Если ВидОперации = 1 Тогда
				ЗаказОбъект.Комментарий = Нстр("ru = 'Сформирован автоматически обработкой ""Пакетная выписка заказов""'; en = 'Generated automatically by the ""Batch Order Checkout"" processing'");
				Если ТипЗнч(ТекСтрока.ТС) = Тип("СправочникСсылка.уатТС") Тогда 
					ЗаказОбъект.Комментарий = ЗаказОбъект.Комментарий + " " + СтрШаблон(Нстр("ru = 'для ТС ""%1""'; en = 'for TS ""%1""'"), ТекСтрока.ТС);
				КонецЕсли;
			КонецЕсли;
			
			ЗаказОбъект.Заполнить(Неопределено);
			
			ЗаполнитьЗаказПоПодготовке(ЗаказОбъект, ТекСтрока);
			
			ЗаказОбъект.РассчитатьИтоговыеПоказатели();
			ЗаказОбъект.АвтоматическийПересчетДоходовИРасходов();
			
			Если Не ЗаказОбъект.ПроверитьЗаполнение() Тогда
				ТекстОшибки = НСтр("en='Order record';ru='Запись заказа'") + " " + ЗаказОбъект + " " + НСтр("en='cancelled: incorrect filling of document.';ru='отменена: некорректное заполнение документа.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Попытка
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстОшибки = НСтр("en='While recording order';ru='При записи заказа'") + " " + ЗаказОбъект + " " + НСтр("en='Error occurred:';ru='возникла ошибка:'") + Символы.ПС + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецПопытки;
			
			ТекСтрока.ДокументЗаказ = ЗаказОбъект.Ссылка;
			ТекСтрока.Пометка = Ложь;
			
		КонецЦикла;
	Иначе
		
		ЗаказОбъект = Документы.уатЗаказГрузоотправителя.СоздатьДокумент();
		ЗаказОбъект.Дата = ТекущаяДатаСеанса();
		ЗаказОбъект.ДетализацияЗакрытия = СтруктураДляСозданияЗаказа.ДетализацияЗакрытия;
		ЗаказОбъект.Организация   = СтруктураДляСозданияЗаказа.Организация;
		ЗаказОбъект.Подразделение = СтруктураДляСозданияЗаказа.Подразделение;
		Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		ЗаказОбъект.Ответственный = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
		"ОсновнойОтветственный");
		
		ЗаказОбъект.Заполнить(Неопределено);
		
		ЗаполнитьЗаказПоПодготовке(ЗаказОбъект, СтруктураДляСозданияЗаказа);
		
		ЗаказОбъект.РассчитатьИтоговыеПоказатели();
		ЗаказОбъект.АвтоматическийПересчетДоходовИРасходов();
		
		Если Не ЗаказОбъект.ПроверитьЗаполнение() Тогда
			ТекстСообщения = НСтр("en='Order record';ru='Запись заказа'") + " " + ЗаказОбъект + " " + НСтр("en='cancelled: incorrect filling of document.';ru='отменена: некорректное заполнение документа.'");
			Возврат;
		КонецЕсли;
		
		Попытка
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстСообщения = НСтр("en='While recording order';ru='При записи заказа'") + " " + ЗаказОбъект + " " + НСтр("en='Error occurred:';ru='возникла ошибка'");
			Возврат;
		КонецПопытки;
		
		МассивТекстаСообщения = Новый Массив;
		МассивТекстаСообщения.Добавить(НСтр("ru = 'Документ ""'; en = 'Document ""'"));
		МассивТекстаСообщения.Добавить(Новый ФорматированнаяСтрока(Строка(ЗаказОбъект.Ссылка),,,,
			ПолучитьНавигационнуюСсылку(ЗаказОбъект.Ссылка)));
		МассивТекстаСообщения.Добавить(НСтр("ru = '"" записан успешно'; en = '""recorded successfully'"));
		ТекстСообщения = Новый ФорматированнаяСтрока(МассивТекстаСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Заполнить заказ по подготовке на клиенте
//
// Параметры:
//  СтруктураДляСозданияЗаказа - Структура объекта документа "Потребность в перевозке"
//
&НаКлиенте
Процедура ЗаполнитьЗаказПоПодготовкеНаКлиенте(СтруктураДляСозданияЗаказа, ТекстСообщения) Экспорт
	
	СформироватьЗаказыСервер(СтруктураДляСозданияЗаказа, ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказПоПодготовке(ЗаказОбъект, ТекСтрока)
	
	Если ТекСтрока.Свойство("Предварительная") Тогда
		
		ЗаказОбъект.ДокументОснование = ТекСтрока.ДокументОснование;
		ТекСтрока.ДокументПотребность.ПунктыНазначения = ПреобразованиеМассивВТаблицуЗначений(ТекСтрока.ДокументПотребность.ПунктыНазначения);
		ТекСтрока.ДокументПотребность.ГрузовойСостав = ПреобразованиеМассивВТаблицуЗначений(ТекСтрока.ДокументПотребность.ГрузовойСостав);
		ТекСтрока.ДокументПотребность.ТоварныйСостав = ПреобразованиеМассивВТаблицуЗначений(ТекСтрока.ДокументПотребность.ТоварныйСостав);
		ТекСтрока.ДокументПотребность.Услуги = ПреобразованиеМассивВТаблицуЗначений(ТекСтрока.ДокументПотребность.Услуги);
		ТекСтрока.ДокументПотребность.ПромежуточныеПункты = ПреобразованиеМассивВТаблицуЗначений(ТекСтрока.ДокументПотребность.ПромежуточныеПункты);
		ЗаказОбъект.Мультимодальный = ТекСтрока.ДокументПотребность.Мультимодальный;
		ЗаказОбъект.ДополнительныеСвойства.Вставить("НеПроверятьFTL", Истина);
		
		ВидОперации = 0;
		
	Иначе
		
		ЗаказОбъект.ДокументОснование   = ТекСтрока.ДокументПотребность;
		
	КонецЕсли;
	
	ЗаказОбъект.IDСтрокиПотребности = ТекСтрока.IDСтроки;
	ЗаказОбъект.IDДатыДействияПотребности = ТекСтрока.IDДатыДействия;
	
	Если ВидОперации = 0 Тогда
		СтрокаПотребности = ТекСтрока.ДокументПотребность.ПунктыНазначения.Найти(ТекСтрока.IDСтроки, "ID");
		Если СтрокаПотребности = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		СтрокаПотребности = Новый Структура("FTL, Маршрут, СтоянкаПунктОтправления, СтоянкаПунктНазначения,
		|ВесБрутто, Объем, КоличествоМест",
		Ложь, ТекСтрока.ВариантАналитикиМаршрут, 0, 0, ТекСтрока.ВесГруза, ТекСтрока.ОбъемГруза, ТекСтрока.КоличествоГруза);
	КонецЕсли;
	
	Если ВидОперации = 0 Тогда 
		ЗаказОбъект.Подразделение                  = ТекСтрока.ДокументПотребность.Подразделение;
		ЗаказОбъект.Контрагент                     = ТекСтрока.ДокументПотребность.Контрагент;
		ЗаказОбъект.КонтактноеЛицоЗаказчика        = ТекСтрока.ДокументПотребность.КонтактноеЛицоЗаказчика;
		ЗаказОбъект.ДоговорКонтрагента             = ТекСтрока.ДокументПотребность.ДоговорКонтрагента;
		ЗаказОбъект.ВалютаТоваров                  = ТекСтрока.ДокументПотребность.ВалютаТоваров;
		ЗаказОбъект.ВалютаДокумента                = ТекСтрока.ДокументПотребность.ВалютаДокумента;
		ЗаказОбъект.КурсВзаиморасчетов             = ТекСтрока.ДокументПотребность.КурсВзаиморасчетов;
		ЗаказОбъект.КратностьВзаиморасчетов        = ТекСтрока.ДокументПотребность.КратностьВзаиморасчетов;
		ЗаказОбъект.СуммаВключаетНДС               = ТекСтрока.ДокументПотребность.СуммаВключаетНДС;
		ЗаказОбъект.УчитыватьНДС                   = ТекСтрока.ДокументПотребность.УчитыватьНДС;
		ЗаказОбъект.СуммаДокумента                 = ТекСтрока.ДокументПотребность.СуммаДокумента;
		ЗаказОбъект.ДетализацияЗакрытия            = ТекСтрока.ДокументПотребность.ДетализацияЗаказов;
	Иначе  
		ЗаказОбъект.Подразделение                  = ТекСтрока.ДокументПланирования.Подразделение;
		ЗаказОбъект.Контрагент                     = ТекСтрока.Контрагент;
		ЗаказОбъект.КонтактноеЛицоЗаказчика        = ТекСтрока.КонтактноеЛицоЗаказчика;
		ЗаказОбъект.ДоговорКонтрагента             = ТекСтрока.ДоговорКонтрагента;
		ЗаказОбъект.ДетализацияЗакрытия            = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам;
	КонецЕсли;
	
	ЗаказОбъект.АдресОтправления               = ТекСтрока.АдресОтправления;
	ЗаказОбъект.АдресНазначения                = ТекСтрока.АдресНазначения;
	ЗаказОбъект.ТребованиеКТС                  = ТекСтрока.ТребованиеКТС;
	ЗаказОбъект.ТребованиеКТСТипТС             = ТекСтрока.ТребованиеКТСТипТС;

	ЗаказОбъект.Грузоотправитель               = ТекСтрока.Грузоотправитель;
	ЗаказОбъект.Грузополучатель                = ТекСтрока.Грузополучатель;
	ЗаказОбъект.КонтактноеЛицоГрузоотправителя = ТекСтрока.КонтактноеЛицоГрузоотправителя;
	ЗаказОбъект.КонтактноеЛицоГрузополучателя  = ТекСтрока.КонтактноеЛицоГрузополучателя;
	ЗаказОбъект.ВидПеревозки                   = ТекСтрока.ВидПеревозки;
	ЗаказОбъект.НаправлениеПеревозки           = ТекСтрока.НаправлениеПеревозки;
	ЗаказОбъект.ВидДоставки                    = ТекСтрока.ВидДоставки;
	ЗаказОбъект.ОбъектСтроительства            = ТекСтрока.ОбъектСтроительства;
	ЗаказОбъект.FTL                            = СтрокаПотребности.FTL;
	ЗаказОбъект.Маршрут                        = СтрокаПотребности.Маршрут;
	ЗаказОбъект.СтоянкаПунктОтправления        = СтрокаПотребности.СтоянкаПунктОтправления;
	ЗаказОбъект.СтоянкаПунктНазначения         = СтрокаПотребности.СтоянкаПунктНазначения;
	
	Если ТекСтрока.Свойство("Предварительная") Тогда
		
		ЗаказОбъект.ОтправлениеС                   = ТекСтрока.ОтправлениеС;
		ЗаказОбъект.ОтправлениеПо                  = ТекСтрока.ОтправлениеПо;
		
		ЗаказОбъект.ДоставкаС                      = ТекСтрока.ПрибытиеС;
		ЗаказОбъект.ДоставкаПо                     = ТекСтрока.ПрибытиеПо;
		
	Иначе
		
		ЗаказОбъект.ОтправлениеС                   = ТекСтрока.ДатаОтправления + (ТекСтрока.ОтправлениеС - '00010101');
		ЗаказОбъект.ОтправлениеПо                  = ТекСтрока.ДатаОтправления + (ТекСтрока.ОтправлениеПо - '00010101');
		
		// Перенос даты на следующий день
		Если ЗначениеЗаполнено(ТекСтрока.ОтправлениеС) И ЗначениеЗаполнено(ТекСтрока.ОтправлениеПо) И 
			ТекСтрока.ОтправлениеС > ТекСтрока.ОтправлениеПо Тогда
			
			ЗаказОбъект.ОтправлениеПо = ЗаказОбъект.ОтправлениеПо + 86400;
		КонецЕсли;
		
		ЗаказОбъект.ДоставкаС                      = ТекСтрока.ДатаПрибытия + (ТекСтрока.ПрибытиеС - '00010101');
		ЗаказОбъект.ДоставкаПо                     = ТекСтрока.ДатаПрибытия + (ТекСтрока.ПрибытиеПо - '00010101');
		
		// Перенос даты на следующий день
		Если ЗначениеЗаполнено(ТекСтрока.ПрибытиеС) И ЗначениеЗаполнено(ТекСтрока.ПрибытиеПо) И 
			ТекСтрока.ПрибытиеС > ТекСтрока.ПрибытиеПо Тогда
			
			ЗаказОбъект.ДоставкаПо = ЗаказОбъект.ДоставкаПо + 86400;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаказОбъект.ВесБрутто                      = СтрокаПотребности.ВесБрутто;
	ЗаказОбъект.Объем                          = СтрокаПотребности.Объем;
	ЗаказОбъект.КоличествоМест                 = СтрокаПотребности.КоличествоМест;
	
	Если ВидОперации = 0 Тогда
		ЗаказОбъект.Расстояние                     = СтрокаПотребности.Расстояние;
		ЗаказОбъект.ПробегСГрузом                  = СтрокаПотребности.ПробегСГрузом;
		ЗаказОбъект.Время                          = СтрокаПотребности.Время;
		ЗаказОбъект.Стоянка                        = СтрокаПотребности.Стоянка;
		ЗаказОбъект.СтоимостьГруза                 = СтрокаПотребности.СтоимостьГруза;
		ЗаказОбъект.НазваниеГруза                  = ТекСтрока.ОписаниеГруза;
		
		СоответствиеГрузов = Новый Соответствие;
		СоответствиеПунктов = Новый Соответствие;
		
		Для Каждого ТекСтрокаГрузМесто Из ТекСтрока.ДокументПотребность.ГрузовойСостав Цикл
			Если ТекСтрокаГрузМесто.ID = ТекСтрока.IDСтроки Тогда
				НоваяСтрока = ЗаказОбъект.ГрузовойСостав.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаГрузМесто);
				Если ЗаказОбъект.FTL 
					И (ЗаказОбъект.ДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоГрузовымМестам
					Или ЗаказОбъект.ДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам) Тогда
					СоответствиеГрузов.Вставить(ТекСтрокаГрузМесто.НомерСтроки, НоваяСтрока.НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаТовар Из ТекСтрока.ДокументПотребность.ТоварныйСостав Цикл
			Если ТекСтрокаТовар.ID = ТекСтрока.IDСтроки Тогда
				НоваяСтрока = ЗаказОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовар);
				Если ЗаказОбъект.FTL 
					И ЗаказОбъект.ДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоТоварам Тогда
					СоответствиеГрузов.Вставить(ТекСтрокаТовар.НомерСтроки, НоваяСтрока.НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() И ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки")
			И Не ТекСтрока.Свойство("Предварительная") Тогда
			
			Если ТекСтрока.ДокументПотребность.ДетализацияЗаказов = ПредопределенноеЗначение("Перечисление.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам") Тогда
				ЗаказОбъект.КодГруза = ТекСтрока.ДокументПотребность.КодГруза;
			КонецЕсли;
			
			Для Каждого ТекСтрокаПотребностьВВагонах Из ТекСтрока.ДокументПотребность.ПотребностьВВагонах Цикл
				Если ТекСтрокаПотребностьВВагонах.ID = ТекСтрока.IDСтроки Тогда
					НоваяСтрока = ЗаказОбъект.ПотребностьВВагонах.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаПотребностьВВагонах);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого ТекСтрокаУслуга Из ТекСтрока.ДокументПотребность.Услуги Цикл
			Если ТекСтрокаУслуга.ID = ТекСтрока.IDСтроки Тогда
				НоваяСтрока = ЗаказОбъект.Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуга);
				НоваяСтрока.СтатьяДоходов = Справочники.уатСтатьиДоходов.ОсновнаяСтатьяДоходов;
				НоваяСтрока.Содержание = НоваяСтрока.Номенклатура;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаЗатрата Из ТекСтрока.ДокументПотребность.Расходы Цикл
			Если ТекСтрокаЗатрата.ID = ТекСтрока.IDСтроки Тогда
				НоваяСтрока = ЗаказОбъект.Расходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗатрата);
				НоваяСтрока.Содержание = НоваяСтрока.Номенклатура;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаВыработки Из ТекСтрока.ДокументПотребность.Выработка Цикл
			Если ТекСтрокаВыработки.ID = ТекСтрока.IDСтроки Тогда
				НоваяСтрока = ЗаказОбъект.Выработка.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаВыработки);
			КонецЕсли;
		КонецЦикла;
		
		КолДнейДобавить = Неопределено;
		Для Каждого ТекСтрокаПП Из ТекСтрока.ДокументПотребность.ПромежуточныеПункты Цикл
			Если ТекСтрокаПП.ID = ТекСтрока.IDСтроки Тогда
				НоваяСтрока = ЗаказОбъект.ПромежуточныеПункты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаПП);
				Если КолДнейДобавить = Неопределено Тогда
					// Все даты и временные окна в таблице промежуточных пунктов сдвигаются на это количество дней
					РазницаВДнях    = (НачалоДня(ТекСтрока.ДатаОтправления) - НачалоДня(НоваяСтрока.ПрибытиеПлан)) / (60 * 60 * 24);
					КолДнейДобавить = РазницаВДнях*24*60*60;
				КонецЕсли;
				НоваяСтрока.ПрибытиеПлан = НоваяСтрока.ПрибытиеПлан + КолДнейДобавить;
				НоваяСтрока.УбытиеПлан   = НоваяСтрока.УбытиеПлан   + КолДнейДобавить;
				НоваяСтрока.ОкноС        = НоваяСтрока.ОкноС        + КолДнейДобавить;
				НоваяСтрока.ОкноПо       = НоваяСтрока.ОкноПо       + КолДнейДобавить;
				
				Если ЗаказОбъект.FTL Тогда
					СоответствиеПунктов.Вставить(ТекСтрокаПП.НомерСтроки, НоваяСтрока.НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СтруктураОбъектовНастроек = Новый Структура;
		СтруктураОбъектовНастроек.Вставить("Организация", ЗаказОбъект.Организация);
		СтруктураОбъектовНастроек.Вставить("Подразделение", ЗаказОбъект.Подразделение);
		СтруктураОбъектовНастроек.Вставить("Пользователь", ПользователиКлиентСервер.АвторизованныйПользователь());

		ЗаказОбъект.ВидПеревозки = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураОбъектовНастроек, ПланыВидовХарактеристик.уатПраваИНастройки.ОсновнойВидПеревозок);
		ЗаказОбъект.ВидДоставки  = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураОбъектовНастроек, ПланыВидовХарактеристик.уатПраваИНастройки.ОсновнойВидДоставки);

		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			НоваяСтрока            = ЗаказОбъект.Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрока.КоличествоГруза;
			НоваяСтрока.ВесБрутто  = ТекСтрока.ВесГруза;
			НоваяСтрока.Объем      = ТекСтрока.ОбъемГруза;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
			НоваяСтрока.ЕдиницаИзмерения = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(
				НоваяСтрока.Номенклатура,
				"ЕдиницаХраненияОстатков"
				);

		КонецЕсли;
		
	КонецЕсли;

	Если ЗаказОбъект.FTL Тогда
		Для Каждого ТекСтрокаОтрезокПути Из ТекСтрока.ДокументПотребность.ОтрезкиПути Цикл
			Если ТекСтрокаОтрезокПути.ID = ТекСтрока.IDСтроки Тогда
				НоваяСтрока = ЗаказОбъект.ОтрезкиПути.Добавить();
				НоваяСтрока.ПунктОтправления = СоответствиеПунктов.Получить(ТекСтрокаОтрезокПути.ПунктОтправления);
				НоваяСтрока.ПунктНазначения = СоответствиеПунктов.Получить(ТекСтрокаОтрезокПути.ПунктНазначения);
				НоваяСтрока.Груз = СоответствиеГрузов.Получить(ТекСтрокаОтрезокПути.Груз);
			КонецЕсли;
		КонецЦикла;
		
		// Обновление id отрезков пути
		Для Каждого ТекСтрокаОтрезокПути Из ЗаказОбъект.ОтрезкиПути Цикл
			Если ТекСтрокаОтрезокПути.id <> "" Тогда 
				Продолжить;
			КонецЕсли;
			ТекСтрокаОтрезокПути.id = Строка(Новый УникальныйИдентификатор);
			Для Сч = ТекСтрокаОтрезокПути.НомерСтроки По ЗаказОбъект.ОтрезкиПути.Количество()-1 Цикл
				Если ТекСтрокаОтрезокПути.ПунктНазначения = ЗаказОбъект.ОтрезкиПути[Сч].ПунктНазначения
					И ТекСтрокаОтрезокПути.ПунктОтправления = ЗаказОбъект.ОтрезкиПути[Сч].ПунктОтправления Тогда
					ЗаказОбъект.ОтрезкиПути[Сч].id = ТекСтрокаОтрезокПути.id;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаЗаполнить(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Если ВидОперации = 0 Тогда
			ЗаполнитьТаблицуСервер();
		Иначе
			ЗаполнитьТаблицуПланСервер();
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаСформировать(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		СформироватьЗаказыСервер();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГрузоотправительПриИзмененииСервер(СтруктураСтроки, АдресИзменен=Ложь)
	Если ЗначениеЗаполнено(СтруктураСтроки.Грузоотправитель) Тогда
		Если СтруктураСтроки.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладДверь")
			ИЛИ СтруктураСтроки.ВидДоставки = ПредопределенноеЗначение("Перечисление.уатВидыДоставки_уэ.СкладСклад")
			ИЛИ ТипЗнч(СтруктураСтроки.Грузоотправитель) = Тип("СправочникСсылка.Склады") Тогда
			АдресОтправления = уатОбщегоНазначения_уэ.АдресСклада(СтруктураСтроки.Грузоотправитель);
		Иначе
			АдресОтправления = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтруктураСтроки.Грузоотправитель, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
			Если Не ЗначениеЗаполнено(АдресОтправления) Тогда
				АдресОтправления = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтруктураСтроки.Грузоотправитель, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресОтправления) И СтруктураСтроки.АдресОтправления <> АдресОтправления Тогда
			СтруктураСтроки.АдресОтправления = АдресОтправления;
			АдресИзменен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если уатОбщегоНазначенияТиповые.уатЕстьРеквизитСправочника("ОсновноеКонтактноеЛицо", СтруктураСтроки.Грузоотправитель) Тогда
		СтруктураСтроки.КонтактноеЛицоГрузоотправителя = СтруктураСтроки.Грузоотправитель.ОсновноеКонтактноеЛицо;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервер(СтруктураСтроки)
	СтруктураСтроки.КонтактноеЛицоЗаказчика = уатОбщегоНазначения.ПолучитьКонтактноеЛицоКонтрагента(СтруктураСтроки.Контрагент);
КонецПроцедуры

&НаСервере
Процедура ГрузополучательПриИзмененииСервер(СтруктураСтроки, АдресИзменен=Ложь)
	Если ЗначениеЗаполнено(СтруктураСтроки.Грузополучатель) Тогда 
		Если СтруктураСтроки.ВидДоставки = Перечисления.уатВидыДоставки_уэ.ДверьСклад
			ИЛИ СтруктураСтроки.ВидДоставки = Перечисления.уатВидыДоставки_уэ.СкладСклад
			ИЛИ ТипЗнч(СтруктураСтроки.Грузополучатель) = Тип("СправочникСсылка.Склады") Тогда
			АдресНазначения = уатОбщегоНазначения_уэ.АдресСклада(СтруктураСтроки.Грузополучатель);
		Иначе
			АдресНазначения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтруктураСтроки.Грузополучатель,
				Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
			Если Не ЗначениеЗаполнено(АдресНазначения) Тогда
				АдресНазначения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтруктураСтроки.Грузополучатель,
					Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресНазначения) И Не СтруктураСтроки.АдресНазначения = АдресНазначения Тогда 
			СтруктураСтроки.АдресНазначения = АдресНазначения;
			АдресИзменен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если уатОбщегоНазначенияТиповые.уатЕстьРеквизитСправочника("ОсновноеКонтактноеЛицо", СтруктураСтроки.Грузополучатель) Тогда
		СтруктураСтроки.КонтактноеЛицоГрузополучателя = СтруктураСтроки.Грузополучатель.ОсновноеКонтактноеЛицо;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПоПотребностьВПеревозке(Команда)
	Если Элементы.ФормаОперацияЗаполнениеПоПотребностьВПеревозке.Пометка Тогда 
		Возврат;
	КонецЕсли;
	
	ВидОперации = 0;
	ВидОперацииПриИзменении();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПоПланированиюРаботыТС(Команда)
	Если Элементы.ФормаОперацияЗаполнениеПоПланированиюРаботыТС.Пометка Тогда 
		Возврат;
	КонецЕсли;
	
	ВидОперации = 1;
	ВидОперацииПриИзменении();

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении()
	
	Если ВидОперации = 0 Тогда
		Элементы.ФормаОперацияЗаполнениеПоПотребностьВПеревозке.Пометка   = Истина;
		Элементы.ФормаОперацияЗаполнениеПоПланированиюРаботыТС.Пометка    = Ложь;
		
		Элементы.ПотребностиНомерСтроки.Видимость = Истина;
		Элементы.ПотребностиТС.Видимость          = Ложь;

		Элементы.ЗаказыГруппаДокПотребность.Видимость     = Истина;
		Элементы.ПотребностиГруппаПланнирование.Видимость = Ложь;
		Элементы.Сценарий.Видимость                       = Ложь;
		Элементы.ЗаказыОписаниеГруза.Видимость            = Истина;
	Иначе
		Элементы.ФормаОперацияЗаполнениеПоПотребностьВПеревозке.Пометка   = Ложь;
		Элементы.ФормаОперацияЗаполнениеПоПланированиюРаботыТС.Пометка    = Истина;
		
		Элементы.Сценарий.Видимость               = Истина;
		Элементы.ПотребностиНомерСтроки.Видимость = Ложь;
		Элементы.ПотребностиТС.Видимость          = Истина;
		Элементы.ЗаказыОписаниеГруза.Видимость    = Ложь;
		
		Элементы.ЗаказыГруппаДокПотребность.Видимость          = Ложь;
		Элементы.ПотребностиГруппаПланнирование.Видимость      = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВесГруза(ВесГруза, ЕдиницаИзмеренияПлан, ЕдиницаИзмеренияПоУмолчанию)
	
	КиллограммКодПоКлассификатору = 166;
	ТоннаКодПоКлассификатору      = 168;
	
	Если Строка(ЕдиницаИзмеренияПлан) = Строка(ЕдиницаИзмеренияПоУмолчанию) 
		Или (ЕдиницаИзмеренияПлан.Код = КиллограммКодПоКлассификатору И ЕдиницаИзмеренияПоУмолчанию = Перечисления.уатЕдиницыИзмеренияВеса.Килограмм)
		Или (ЕдиницаИзмеренияПлан.Код = ТоннаКодПоКлассификатору И ЕдиницаИзмеренияПоУмолчанию = Перечисления.уатЕдиницыИзмеренияВеса.Тонна) Тогда
		Возврат;
	ИначеЕсли (Строка(ЕдиницаИзмеренияПлан) = Строка(Перечисления.уатЕдиницыИзмеренияВеса.Килограмм)
		И Строка(ЕдиницаИзмеренияПоУмолчанию) = Строка(Перечисления.уатЕдиницыИзмеренияВеса.Тонна))
		Или (ЕдиницаИзмеренияПлан.Код = КиллограммКодПоКлассификатору И ЕдиницаИзмеренияПоУмолчанию = Перечисления.уатЕдиницыИзмеренияВеса.Тонна) Тогда
		ВесГруза = ВесГруза / 1000;
		Возврат;
	Иначе
		ВесГруза = ВесГруза * 1000;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьОбъемГруза(ОбъемГруза, ЕдиницаИзмеренияПлан, ЕдиницаИзмеренияПоУмолчанию)
	
	ЛитрКодПоКлассификатору           = 112;
	МетрКубическийКодПоКлассификатору = 113;
	
	Если Строка(ЕдиницаИзмеренияПлан) = Строка(ЕдиницаИзмеренияПоУмолчанию) 
		Или (ЕдиницаИзмеренияПлан.Код = ЛитрКодПоКлассификатору И ЕдиницаИзмеренияПоУмолчанию = Перечисления.уатЕдиницыИзмеренияОбъема.Литр)
		Или (ЕдиницаИзмеренияПлан.Код = МетрКубическийКодПоКлассификатору И ЕдиницаИзмеренияПоУмолчанию = Перечисления.уатЕдиницыИзмеренияОбъема.МетрКубический) Тогда
		Возврат;
	ИначеЕсли (Строка(ЕдиницаИзмеренияПлан) = Строка(Перечисления.уатЕдиницыИзмеренияОбъема.Литр)
		И Строка(ЕдиницаИзмеренияПоУмолчанию) = Строка(Перечисления.уатЕдиницыИзмеренияОбъема.МетрКубический))
		Или (ЕдиницаИзмеренияПлан.Код = ЛитрКодПоКлассификатору И ЕдиницаИзмеренияПоУмолчанию = Перечисления.уатЕдиницыИзмеренияОбъема.МетрКубический) Тогда
		ОбъемГруза = ОбъемГруза / 1000;
		Возврат;
	Иначе
		ОбъемГруза = ОбъемГруза * 1000;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПреобразованиеМассивВТаблицуЗначений(Массив)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Для Каждого СтрокаМассива Из Массив Цикл
		
		Если ТЗ.Колонки.Количество() = 0 Тогда
			Для Каждого ЭлементМассива Из СтрокаМассива Цикл
				ТЗ.Колонки.Добавить(ЭлементМассива.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		НоваяСтрока = ТЗ.Добавить();
		
		Для Каждого ЭлементМассива Из СтрокаМассива Цикл
			НоваяСтрока[ЭлементМассива.Ключ] = ЭлементМассива.Значение;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

#КонецОбласти
